[
  {
    "uuid": "a9f1c6e5-9383-4d12-b28d-734c9370f861",
    "location": "Exeter, UK",
    "timeStamp": "7 Jan 2025 at 09:30",
    "title": "The Phantom Warning",
    "text": "I was drifting through town, lost in thought, when I stepped into the street without looking. A piercing shriek sliced through the air—an old woman, her voice cracking like dead leaves, screamed for me to stop. I froze and turned just in time to see a bus thunder past, a blast of air clawing at my face. My heart pounded as I looked across to thank her, but the street was empty. No trace of her remained. That’s when the chill set in—she looked exactly like my grandmother, who we buried seven years ago. I still remember the floral scarf she wore... the same one we buried her in."
  },
  {
    "uuid": "47e3291a-6f67-4fc0-9d06-25fa4d1f3ae1",
    "location": "Edinburgh, UK",
    "timeStamp": "20 March 2024 at 11:30",
    "title": "The Pianist's Lament",
    "text": "We wandered into the skeleton of an abandoned theater, its air thick with forgotten breath. As we crept through its crumbling halls, a piano melody began to drift—low, haunting, almost mournful. It drew us to the stage, where a dust-veiled piano sat, keys untouched, strings long dead. Then he appeared: a tall, gaunt figure in tattered evening wear, standing in the balcony like a relic of grief. He stared down at us, his eyes hollow with memory, before dissolving into nothingness. Later, I learned of the fire—the pianist who perished mid-performance, still searching for his final ovation."
  },
  {
    "uuid": "b83cb7e0-df38-493b-b53d-2616175ea5f9",
    "location": "Dunwich, UK",
    "timeStamp": "7 Jan 2025 at 10:00",
    "title": "The Widow in the Rocking Chair",
    "text": "The hotel was ancient, its walls whispering with age. At 2AM, I woke to the slow creak of footsteps across my room, soft and deliberate. I called out, but no answer came. I grappled with the light switch. As my eyes adjusted to the pale, sickly glow that spilled across the room, I noticed the rocking chair in the corner, moving to and fro as if someone had just risen from it. I watched it until it came to a dead, silent stop. In the gray light of dawn, I told the hotel owner. She gave me a knowing glance. 'That chair belonged to Edith. She lost her husband at sea and never left this room again. You’re not the first to feel her presence.'"
  },
  {
    "uuid": "e9f04c9a-4a9e-46d7-bb6f-2af841e1d9b2",
    "location": "Ravenshollow, Scotland",
    "timeStamp": "12 Feb 2025 at 03:47",
    "title": "The Portrait That Wept",
    "text": "During the storm, the old manor lost power. My flashlight beam caught the portrait of a young woman—painted in oil, eyes glistening. I swore I saw moisture gathering at her lashes. The next flash of lightning revealed streaks down her painted cheeks. The caretaker later said the artist went mad after painting it. 'He claimed she was crying for him to let her out.'"
  },
  {
    "uuid": "1a5d83b1-bc67-4a71-8e6a-563b7f35f4d1",
    "location": "Barrow Creek, Australia",
    "timeStamp": "21 Mar 2025 at 23:18",
    "title": "The Vanishing Signal",
    "text": "Driving through the desert, I lost cell service. Then, one bar appeared—only long enough to receive a single message: 'Don’t look behind you.' My headlights flickered, and a shape darted across the road. When I finally stopped at a motel, the receptionist asked what tower I’d connected to. I said, 'Barrow Relay.' Her face went white. 'That tower burned down fifteen years ago. Everyone working it died.'"
  },
  {
    "uuid": "b00f5938-94a2-4f1a-b3cb-97aef6a39b77",
    "location": "Kuldhara, India",
    "timeStamp": "4 Apr 2025 at 01:12",
    "title": "The Whispering Sand",
    "text": "We camped near the ruins despite the warnings. As the fire dimmed, the desert wind began to carry voices—low, urgent, ancient. My friend laughed, saying it was the wind in the dunes. But when I turned toward the sound, my name came back in a hoarse whisper. The next morning, his footprints led away from camp—only to stop abruptly in the middle of the sand, like he had been lifted away."
  },
  {
    "uuid": "d529a7c5-0f1e-465f-99a3-8b9f1a8322b4",
    "location": "Black Hollow, Maine, USA",
    "timeStamp": "19 May 2025 at 02:31",
    "title": "The Reflection in the Window",
    "text": "I was locking up the cabin when I noticed my reflection in the window waving back at me—though my own hand was still at my side. The reflection smiled wider than my face could stretch, then vanished as the power died. The next morning, the glass was covered in handprints, all from the inside."
  },
  {
    "uuid": "c2b3a678-0de9-4a6b-b7c3-b234cb6d83aa",
    "location": "Salem, Massachusetts, USA",
    "timeStamp": "31 Oct 2025 at 00:06",
    "title": "The Candle That Wouldn't Go Out",
    "text": "I found an old candle in a curio shop labeled 'Never Extinguished.' Out of curiosity, I lit it that Halloween night. It burned cold, the flame blue and whispering. At midnight, it began to flicker violently and then—just for a second—every shadow in my room stood upright, watching me. I blew the candle out and ran. When I came back hours later, it was burning again, and something had carved my name into the wax."
  },
  {
    "uuid": "a14e3b1c-9674-4b5e-8a03-29e22d7b2f75",
    "location": "Eldermoor, Canada",
    "timeStamp": "9 Nov 2025 at 02:14",
    "title": "The Knock That Counted",
    "text": "When the snowstorm hit, the cabin shook with the wind's fury. Around midnight, I heard a knock—three slow, deliberate taps on the door. I opened it to nothing but swirling snow. I locked it again, uneasy. Minutes later, another three knocks echoed, this time from the back door. I froze. No footprints outside. No tracks in the snow. By dawn, I thought it had stopped—until I saw the message traced in frost on the windowpane: 'Your turn to knock next.'"
  }
]